{
    "schedule": [
      {
        "time": "11:00 - 11:05",
        "title": "Opening Remarks",
        "speakers": ["Dhabaleswar K (DK) Panda, The Ohio State University"]
      },
      {
        "time": "11:05 - 12:00",
        "title": "Keynote: Building a Data Infrastructure for Agriculture in Arizona",
        "speaker": "Arthur 'Barney' Maccabe, University of Arizona, USA",
        "chair": "Hari Subramoni",
        "abstract": "While Arizona is not likely to be one of the first states that comes to mind when thinking about agricultural production in the US, agriculture in Arizona supports over 130,000 jobs, has a $23.3B economic impact, with exports to over 70 countries. The Yuma Valley in southwestern Arizona produces 90% of the leafy greens consumed in North America between November and March. Given the limited water supply, this kind of productivity could only be achieved by embracing technology. Today, this means embracing AI which means embracing the collection of data. Arizona has several resources, including Biosphere 2 and an outdoor phenotying facility , that will be essential for collecting the data needed to build new models needed for agriculture.",
        "bio": "Arthur B. (Barney) Maccabe is a professor in the College of Information Science at The University of Arizona. From 2009 to 2022, Dr Maccabe served as the Director of the Computer Science and Mathematics Division (CSMD) at the Department of Energy’s Oak Ridge National Laboratory (ORNL) and as the ORNL Point of Contact for the research portion of the Advanced Scientific Computing Research (ASCR) program in the Department of Energy, Office of Science. Prior to his appointment at ORNL, Dr. Maccabe spent over twenty-five years as a professor in the Computer Science Department at the University of New Mexico (UNM) where he graduated eleven PhD students and nine MS students. While at UNM, Dr. Maccabe also served as the director of the Center for High Performance Computing and as the Interim Chief Information Officer for the university. Professor Maccabe’s current research is focused on mechanisms and policies to ensure that the creators of data are able to realize value for the information they provide. His previous research focused on the design and development of system software for massively parallel systems. He was an architect for a series of lightweight operating systems for massively parallel computing systems. Dr. Maccabe has also conducted sponsored research in a wide- range of areas, including: dependence representation for compilers, network intrusion detection, network protocol offload, lightweight file and I/O systems, system software for sensor networks, and virtualization in high end computing systems."
      },
      {
        "time": "12:00 - 12:30",
        "title": "Invited Talk 4: NSF Office of Advanced Cyberinfrastructure’s funding opportunity on HPC and AI",
        "speaker": "Sheikh Ghafoor, National Science Foundation, USA",
        "abstract": "The Office of Advanced Cyberinfrastructure (OAC) supports and coordinates the development, acquisition, and provision of state-of-the-art cyberinfrastructure resources, tools and services essential to the advancement and transformation of domain science and engineering. OAC also supports forward-looking research and education to expand the future capabilities of cyberinfrastructure specific to science and engineering. In these efforts, OAC collaborates with all NSF Offices and Directorates to develop models, prototypes, and approaches to research cyberinfrastructure that open new frontiers for discovery, furthering the mission of the National Science Foundation and national science and engineering priorities. The goal of this talk is to provide an overview of OAC’s perspective, investments, and funding opportunities in HPC and AI.",
        "bio": "Sheikh Ghafoor is a professor of Computer Science at Tennessee Tech University. Currently he is serving as a program director at the US National Science Foundation in the office of Advanced Cyber Infrastructure in the directorate of Computer and Information Science and Engineering. His main research interests are: 1) High Performance Computing, 2) Computational Earth Science, 3) Computer Security, and 4) Computer Science Education. Dr. Ghafoor has published, secured external grants, and has mentored Ph.D. and master’s students in all these areas. Dr. Ghafoor has taught a wide variety of courses with primary teaching interest in HPC and computer networks-related courses. Dr. Ghafoor has been principal investigator on grants from the National Science Foundation, National Aeronautics and Space Administration, Department of Energy, National Security Agency, and other state and federal agencies."
      },
      {
        "time": "12:30 - 2:00",
        "title": "Lunch"
      },
      {
        "time": "2:00 - 3:30",
        "title": "Research Paper Session",
        "chair": "Hari Subramoni",
        "papers": [
          {
            "title": "Ortho-Fuse: Orthomosaic Generation for Sparse High-Resolution Crop Health Datasets Through Intermediate Optical Flow Estimation",
            "authors": ["Rugved Katole, OSU", "Christopher Stewart, OSU"]
          },
          {
            "title": "HARVEST Inference: Characterizing Digital Agriculture Workloads across Compute Continuum",
            "authors": ["Tian Chen, OSU", "Quentin Anthony, OSU", "Dhabaleswar K. Panda, OSU"]
          },
          {
            "title": "An HPC Framework for Multi-Modal Plant Phenotyping Integrating Controlled Environment and Open Field Studies",
            "authors": ["Sungchan Oh, Purdue University", "Libo Zhang, Purdue University", "Yang Yang, Purdue University", "Mitch Tuinstra, Purdue University"]
          },
          {
            "title": "PhenoTracker: A machine learning model to track grape phenology",
            "authors": ["Nathan Balcarcel, Washington State University", "Paola Pesantez-Cabrera, Washington State University", "Kristen Goebel, Oregon State University", "Markus Keller, Washington State University", "Lav Khot, Washington State University", "Alan Fern, Oregon State University", "Ananth Kalyanaraman, Washington State University"]
          },
          {
            "title": "XAIPath: Temporal-Environmental Explainable AI Framework for Co-Contaminated Food Pathogen Detection in Microscopic Imaging",
            "authors": ["Anas AlSobeh, Southern Illinois University", "Amer AbuGhazaleh, Southern Illinois University", "Namariq Dhahir, Southern Illinois University", "Malek Rababa, Southern Illinois University"]
          }
        ]
      },
      {
        "time": "3:30 - 4:00",
        "title": "Coffee Break"
      },
      {
        "time": "4:00 - 5:00",
        "title": "Paper Presentation Session"
      },
      {
        "time": "5:00 - 5:25",
        "title": "Research Posters and Demo Session",
        "projects": [
          {
            "title": "WILD-OV: Weakly-supervised Inference for Localization and Detection in Ecological and Agricultural Visual Scenes Using Open Vocabulary Models",
            "authors": ["Anirudh Potlapally, OSU"]
          },
          {
            "title": "ArrayMorph: Efficient Edge-to-Cloud Data Management for Machine Learning",
            "authors": ["Tinggang Wang, OSU"]
          },
          {
            "title": "Mining Earth's Digital Strata for Geospatial AI: Bridging Data Collection, Synthesis, and Self-Training for Intelligent Earth Observation",
            "authors": ["Aswathnarayanan Radhakrishnan, OSU"]
          }
        ]
      },
      {
        "time": "5:25 - 5:30",
        "title": "Closing Remarks",
        "speakers": [
          "Hari Subramoni, The Ohio State University",
          "Scott Shearer, The Ohio State University"
        ]
      }
    ]
  }
  