{
    "schedule": [
      {
        "time": "11:00 - 11:05",
        "title": "Opening Remarks",
        "speakers": ["Dhabaleswar K (DK) Panda, The Ohio State University"]
      },
      {
        "time": "11:05 - 12:00",
        "title": "Keynote: Plows to Neurons: The Role of HPC and AI in Agriculture",
        "speaker": "Nicholas Butts, John Deere, USA",
        "chair": "Scott Shearer",
        "abstract": "The convergence of High-Performance Computing (HPC) and Artificial Intelligence (AI) is revolutionizing the landscape of autonomy and automation in agriculture. In this keynote, we explore how HPC serves as the backbone for advancing AI-driven systems, unlocking new capabilities in decision-making, real-time processing, and adaptive control. We emphasize the critical importance of performance per watt, highlighting the need to optimize energy efficiency as AI adoption scales in resource-constrained environments. Furthermore, we argue that while larger AI models have garnered significant attention, there is a pressing demand for more efficient and specialized AI architectures that deliver superior performance without compromising computational resources. Lastly, we discuss the necessity of innovative sensor fusion methods to enhance situational awareness and decision-making in complex, dynamic environments. By addressing these challenges, we pave the way for smarter, more sustainable, and scalable autonomous systems that will shape the future of technology.",
        "bio": "Nicholas Butts has over 25 years of experience in embedded systems. He holds both a B.S. and M.S. in Electrical Engineering from North Dakota State University. Currently, Nicholas is a Senior Staff Research Engineer at John Deere, where he focuses on high-performance computing at the edge and machine learning applications in perception and robotics. In the past he has worked on center pivot irrigation control systems, forklift displays, predictive semi-truck cruise controls, tractor displays, telematics devices, software-defined radios, cockpit video recorders, combine grain quality cameras, and digital signal processing for acoustic blockage monitors and seed counting. He has over 18 patents in the agriculture and aerospace markets."
      },
      {
        "time": "12:00 - 12:30",
        "title": "Invited Talk 1: AI – Agricultural Interoperability: Evolving Data Standards in the Era of Artificial Intelligence",
        "speaker": "Ben Craker, AgGateway, USA",
        "abstract": "For over two decades, AgGateway has addressed data interoperability challenges across the agricultural value chain, from standardized B2B messaging in the input supply chain to open-source tools that unlock high-resolution geospatial data from precision equipment. Throughout this journey, waves of technological innovation have shaped the member-led work, but few have shown as much transformative potential as the current surge in artificial intelligence. This session will explore historical parallels between past tech disruptions and today’s AI moment, highlighting how tools like chatbots and generative models are beginning to influence interoperability efforts. We’ll examine how agricultural data standards work is shifting and what new priorities are emerging among AgGateway members.",
        "bio": "Ben Craker is the Portfolio Manager at AgGateway, a global nonprofit organization whose members develop digital resources to address interoperability issues across agricultural industry sectors by providing a unique forum where companies can meet to solve digital challenges. In this role Ben helps facilitate working groups as they address pain points identified by the member organizations. He is also the president of the Ag Data Coalition (ADC), serving in that role since its founding in 2016. The ADC is a non-profit organization that promotes farmer control of data and operates an independent data repository farmers, researchers, and industry can use to store and permission access to data. The ultimate ADC goal is to make data storage a pre-competitive space in the agricultural industry. ddPrior to joining AgGateway staff he spent eighteen years in the farm equipment manufacturing industry at AGCO and Kuhn North America. He held both positions in marketing, sales, global partnering, and product management. He grew up on a farm in south central Wisconsin and graduated from the University of Wisconsin-Platteville with a BS in agricultural business with an engineering technology emphasis. He is still actively involved in the family farm, living in south-central Wisconsin with his wife and three children."
      },
      {
        "time": "12:30 - 2:00",
        "title": "Lunch"
      },
      {
        "time": "2:00 - 3:30",
        "title": "Panel Discussion: Current and Future Deployment of AI in Agriculture",
        "moderator": "Scott Shearer",
        "panelists": [
          "Nicholas Butts, John Deere, USA",
          "Ben Craker, AgGateway, USA",
          "Arthur 'Barney' Maccabe, University of Arizona, USA",
          "Rich Wolski, University of California Santa Barbara, USA",
          "Steven J. Thomson, USDA National Institute of Food and Agriculture, USA"
        ]
      },
      {
        "time": "3:30 - 4:00",
        "title": "Coffee Break"
      },
      {
        "time": "4:00 - 4:30",
        "title": "Invited Talk 2: xGFabric: Coupling Sensor Networks and High-performance Computing Facilities with Advanced Wireless Networks for Near Real-Time Simulation of Digital Agriculture",
        "speaker": "Rich Wolski, University of California Santa Barbara, USA",
        "abstract": "Modern agriculture faces urgent challenges from climate variability and increasing global demands that require rapid, real-time decision support. Traditional High-performance computing systems, remotely sited sensor networks fail to provide the unified, adaptive insights needed for optimal crop management and biosecurity. Emerging 5G/6G technologies—with adaptive low-latency and high-throughput capabilities—offer a transformative opportunity to bridge this gap by creating a resilient, unified, and secure digital-physical fabric, enabling innovative scientific applications in digital agriculture. In this talk, we will present xGFabric -- and end-to-end system for coupling IoT devices and actuators with HPC systems to implement 'modeling-in-the-loop' applications. xGFabric takes advantage of innovations in 5G/6G network infrastructure and a full-stack distributed runtime system to unify computing, network, and storage devices at all device scales. We will discuss the xGFabric architecture and discuss a working prototype that uses in-the-loop Computational Fluid Dynamics to generates real-time predictions of growing conditions for citrus in a specialized facility located in the California Central Valley.",
        "bio": "Dr. Rich Wolski is a Professor of Computer Science at the University of California, Santa Barbara (UCSB) where he holds the Duval Presidential Chair in Energy Efficiency. Having received his M.S. and Ph.D. degrees from the University of California at Davis (while a research scientist at Lawrence Livermore National Laboratory) he has also held positions at the University of California, San Diego, and the University of Tennessee, the the San Diego Supercomputer Center and Lawrence Berkeley National Laboratory. Rich has led several national scale research efforts in the area of distributed systems and is the progenitor of the Eucalyptus open source cloud project."
      },
      {
        "time": "4:30 - 5:00",
        "title": "Invited Talk 3: Funding Opportunities at the Intersection of Agricultural and Computer Science at the USDA-NIFA",
        "speaker": "Steven J. Thomson, USDA National Institute of Food and Agriculture, USA",
        "abstract": "The USDA-NIFA funds projects involving sensing, mechanization, modeling, water, nutrient, and general crop and animal management that involve Machine Learning and AI.  A broad MOU has been in place since 2023 between NIFA and NSF that also allows great flexibility in NSF program collaboration.  Pertinent grant programs will be outlined, and example funded projects will be highlighted.",
        "bio": "Dr. Steven J. Thomson is National Program Leader (NPL) with the USDA National Institute of Food and Agriculture (NIFA) and Fellow with the American Society of Agricultural and Biological Engineers (ASABE). He engages Universities, other federal agencies, and industry to provide national leadership in Capacity and Competitive Grant programs. Grant programs he manages or co-manages at NIFA include Data Science, Engineering and Precision Agriculture, and SBIR Engineering programs. NSF-collaborative programs he manages Include Foundational Research in Robotics, Cyber-Physical Systems, and AI Institutes. He was a Lead Scientist with the USDA ARS before joining USDA-NIFA in 2016 and served seven years on faculty in the Engineering Fundamentals and Biological Systems Engineering (BSE) Departments at Virginia Tech, where he received the Alpha Epsilon (Research/Extension) and Outstanding Faculty awards. He has authored or co-authored over 100 journal articles, two book chapters, and several Extension publications and software."
      },
      {
        "time": "5:00 - 5:25",
        "title": "HARVEST Demo",
        "speakers": [
          "Matt Lieber, The Ohio State University",
          "Anirudh Potlapally, The Ohio State University"
        ]
      },
      {
        "time": "5:25 - 5:30",
        "title": "Closing Remarks",
        "speakers": [
          "Hari Subramoni, The Ohio State University",
          "Scott Shearer, The Ohio State University"
        ]
      },
      {
        "time": "5:35 - 7:00",
        "title": "Visit to SDSC Computing Facilities"
      }
    ]
  }
  